example_answer_workout = {
                                  "День 1": {
                                    "тренировка": [
                                      {
                                        "упражнение": "Классические отжимания",
                                        "повторения": 15,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Жим гантелей лежа",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Тяга штанги в наклоне",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Приседания",
                                        "повторения": 15,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Косые скручивания в боковой планке",
                                        "повторения": 60,
                                        "подходы": 3
                                      }
                                    ]
                                  },
                                  "День 2": {
                                    "тренировка": [
                                      {
                                        "упражнение": "Отжимания от стульев",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Разведение гантелей лежа",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Подтягивания широким хватом",
                                        "повторения": 10,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Выпады",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Скручивания",
                                        "повторения": 20,
                                        "подходы": 3
                                      }
                                    ]
                                  },
                                  "День 4": {
                                    "тренировка": [
                                      {
                                        "упражнение": "Отжимания узким хватом",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Жим штанги лежа",
                                        "повторения": 10,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Тяга гантели в наклоне",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Приседания с гантелями",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Косые скручивания в боковой планке",
                                        "повторения": 60,
                                        "подходы": 3
                                      }
                                    ]
                                  },
                                  "День 5": {
                                    "тренировка": [
                                      {
                                        "упражнение": "Классические отжимания с колен",
                                        "повторения": 15,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Пуловер с гантелей",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Подтягивания обратным хватом",
                                        "повторения": 10,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Выпады назад",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Пловец (без участия ног)",
                                        "повторения": 60,
                                        "подходы": 3
                                      }
                                    ]
                                  },
                                  "День 7": {
                                    "тренировка": [
                                      {
                                        "упражнение": "Отжимания ноги на возвышенности",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Жим гантелей под положительным углом",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Тяга штанги в наклоне обратным хватом",
                                        "повторения": 12,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Приседания со штангой",
                                        "повторения": 10,
                                        "подходы": 3
                                      },
                                      {
                                        "упражнение": "Косые скручивания в боковой планке",
                                        "повторения": 60,
                                        "подходы": 3
                                      }
                                    ]
                                  }
}
